/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strchr.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: arakhurs <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/03/13 12:56:13 by arakhurs          #+#    #+#             */
/*   Updated: 2022/03/17 19:44:52 by arakhurs         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"
//հայտնաբերում է c-ի առաջին հայտնվելը str-ում և տպում դրանից հետո մնացած պարունակությունը
char	*ft_strchr(const char *str, int c)
{
	int	i;//Hello c="l"
		  //01234
	i = 0;
	while (str[i])
	{
		if (str[i] == (char)c)//search "l"
			return ((char *)(str + i));//lo
		i++;
	}
	if (str[i] == (char)c)
		return ((char *)(str + i));
	return (0);
}
